---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.CurveIsFilled
source: html/194607b6-bfd0-e89b-0b2c-0672b7bf5718.htm
---
# Autodesk.Revit.DB.ParameterTypeId.CurveIsFilled Property

"Filled"

## Syntax (C#)
```csharp
public static ForgeTypeId CurveIsFilled { get; }
```